export const beckQuestions = [
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      { text: "Я не чувствую себя расстроенным, печальным", value: 0 },
      { text: "Я расстроен.", value: 1 },
      {
        text: "Я все время расстроен и не могу от этого отключиться. ",
        value: 2,
      },
      {
        text: "Я настолько расстроен и несчастлив, что не могу это выдержать.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      { text: "Я не тревожусь о своем будущем.", value: 0 },
      { text: "Я чувствую, что озадачен будущим.", value: 1 },
      {
        text: "Я чувствую, что меня ничего не ждет в будущем.",
        value: 2,
      },
      {
        text: "Мое будущее безнадежно, и ничто не может измениться к лучшему.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      { text: "Я не чувствую себя неудачником.", value: 0 },
      {
        text: "Я чувствую, что терпел больше неудач, чем другие люди.",
        value: 1,
      },
      {
        text: "Когда я оглядываюсь на свою жизнь, я вижу в ней много неудач.",
        value: 2,
      },
      {
        text: "Я чувствую, что как личность я — полный неудачник.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я получаю столько же удовлетворения от жизни, как раньше.",
        value: 0,
      },
      {
        text: " Я не получаю столько же удовлетворения от жизни, как раньше.",
        value: 1,
      },
      {
        text: "Я больше не получаю удовлетворения ни от чего.",
        value: 2,
      },
      {
        text: "Я полностью не удовлетворен жизнью и мне все надоело.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      { text: "Я не чувствую себя в чем-нибудь виноватым.", value: 0 },
      {
        text: "Достаточно часто я чувствую себя виноватым.",
        value: 1,
      },
      {
        text: "Большую часть времени я чувствую себя виноватым.",
        value: 1,
      },
      {
        text: "Я постоянно испытываю чувство вины.",
        value: 1,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я не чувствую, что могу быть наказанным за что-либо.",
        value: 0,
      },
      {
        text: "Я чувствую, что могу быть наказан.",
        value: 1,
      },
      {
        text: "Я ожидаю, что могу быть наказан.",
        value: 2,
      },
      {
        text: "Я чувствую себя уже наказанным.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я не разочаровался в себе.",
        value: 0,
      },
      {
        text: "Я разочаровался в себе.",
        value: 1,
      },
      {
        text: "Я себе противен.",
        value: 2,
      },
      {
        text: "Я себя ненавижу.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я знаю, что я не хуже других.",
        value: 0,
      },
      {
        text: "Я критикую себя за ошибки и слабости.",
        value: 1,
      },
      {
        text: "Я все время обвиняю себя за свои поступки.",
        value: 2,
      },
      {
        text: "Я виню себя во всем плохом, что происходит.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я никогда не думал покончить с собой.",
        value: 0,
      },
      {
        text: "Ко мне приходят мысли покончить с собой, но я не буду их осуществлять.",
        value: 1,
      },
      {
        text: "Я хотел бы покончить с собой.",
        value: 2,
      },
      {
        text: "Я бы убил себя, если бы представился случай.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я плачу не больше, чем обычно.",
        value: 0,
      },
      {
        text: "Сейчас я плачу чаще, чем раньше.",
        value: 1,
      },
      {
        text: "Теперь я все время плачу.",
        value: 2,
      },
      {
        text: "Раньше я мог плакать, а сейчас не могу, даже если мне хочется.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Сейчас я раздражителен не более, чем обычно.",
        value: 0,
      },
      {
        text: "Я более легко раздражаюсь, чем раньше.",
        value: 1,
      },
      {
        text: "Теперь я постоянно чувствую, что раздражен.",
        value: 2,
      },
      {
        text: "Я стал равнодушен к вещам, которые меня раньше раздражали.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я не утратил интереса к другим людям.",
        value: 0,
      },
      {
        text: "Я меньше интересуюсь другими людьми, чем раньше.",
        value: 1,
      },
      {
        text: "Я почти потерял интерес к другим людям.",
        value: 2,
      },
      {
        text: "Я полностью утратил интерес к другим людям.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я откладываю принятие решения иногда, как и раньше.",
        value: 0,
      },
      {
        text: "Я чаще, чем раньше, откладываю принятие решения.",
        value: 1,
      },
      {
        text: "Мне труднее принимать решения, чем раньше.",
        value: 2,
      },
      {
        text: "Я больше не могу принимать решения.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я не чувствую, что выгляжу хуже, чем обычно.",
        value: 0,
      },
      {
        text: "Меня тревожит, что я выгляжу старым и непривлекательным.",
        value: 1,
      },
      {
        text: "Я знаю, что в моей внешности произошли существенные изменения, делающие меня непривлекательным.",
        value: 2,
      },
      {
        text: "Я знаю, что выгляжу безобразно.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я могу работать так же хорошо, как и раньше.",
        value: 0,
      },
      {
        text: "Мне необходимо сделать дополнительное усилие, чтобы начать делать что-нибудь.",
        value: 1,
      },
      {
        text: "Я с трудом заставляю себя делать что-либо.",
        value: 2,
      },
      {
        text: "Я совсем не могу выполнять никакую работу.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я сплю так же хорошо, как и раньше.",
        value: 0,
      },
      {
        text: "Сейчас я сплю хуже, чем раньше.",
        value: 1,
      },
      {
        text: "Я просыпаюсь на 1-2 часа раньше, и мне трудно заснуть опять.",
        value: 2,
      },
      {
        text: "Я просыпаюсь на несколько часов раньше обычного и больше не могу заснуть.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я устаю не больше, чем обычно.",
        value: 0,
      },
      {
        text: "Теперь я устаю быстрее, чем раньше.",
        value: 1,
      },
      {
        text: "Я устаю почти от всего, что я делаю.",
        value: 2,
      },
      {
        text: "Я не могу ничего делать из-за усталости.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Мой аппетит не хуже, чем обычно.",
        value: 0,
      },
      {
        text: "Мой аппетит стал хуже, чем раньше.",
        value: 1,
      },
      {
        text: "Мой аппетит теперь значительно хуже.",
        value: 2,
      },
      {
        text: "У меня вообще нет аппетита.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "В последнее время я не похудел или потеря веса была незначительной.",
        value: 0,
      },
      {
        text: "За последнее время я потерял более 2 кг.",
        value: 1,
      },
      {
        text: "Я потерял более 5 кг.",
        value: 2,
      },
      {
        text: "Я потерял более 7 кr.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "Я беспокоюсь о своем здоровье не больше, чем обычно.",
        value: 0,
      },
      {
        text: "Меня тревожат проблемы моего физического здоровья, такие, как боли, расстройство желудка, запоры и т.д.",
        value: 1,
      },
      {
        text: "Я очень обеспокоен своим физическим состоянием, и мне трудно думать о чем-либо другом.",
        value: 2,
      },
      {
        text: "Я настолько обеспокоен своим физическим состоянием, что больше ни о чем не могу думать.",
        value: 3,
      },
    ],
  },
  {
    text: "Как вы себя чувствовали сегодня и на этой неделе?",
    answers: [
      {
        text: "В последнее время я не замечал изменения своего интереса к близости.",
        value: 0,
      },
      {
        text: "Меня меньше занимают проблемы близости, чем раньше.",
        value: 1,
      },
      {
        text: "Сейчас я значительно меньше интересуюсь межполовыми отношениями, чем раньше.",
        value: 2,
      },
      {
        text: "Я полностью утратил либидо интерес.",
        value: 3,
      },
    ],
  },
];
